Revit 2027 API
ITransientElementMaker.Execute Method
 Implement this method to create transient elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
void Execute()
Sub Execute
void Execute()
abstract Execute : unit -> unit
See Also
Reference
ITransientElementMaker Interface
Autodesk.Revit.DB Namespace